In [1]:
import pandas as pd
import sqlalchemy as sql
from sqlalchemy import MetaData
from config import db_uri

In [2]:
engine = sql.create_engine(db_uri)
engine

Engine(mysql://root:***@localhost/python_exercise_2)

In [3]:
df_data_owner = pd.read_sql_table('owner', engine)
df_data_puppies = pd.read_sql_table('puppies', engine)

In [4]:
df_data_owner

   owner_id owner_name          address           city state zipcode
0         1       marc       120 elm st          miami    fl   30050
1         2      frank  151 johnson ave         austin    tx   77102
2         3      maria   746 clinton ct   philadelphia    pa   11203
3         4     joanne    12003 main st     littletown    ks   20303
4         5      miles    12034 main rd      smalltown    ms   24455
5         6       luke    74847 left ln        seattle    wa   98748
6         7      moses     836 ocean dr  san francisco    ca   98288
7         8     hannah     89 pines ave    albuquerque    nm   11253
8         9      sarah    345 valley st        phoenix    az   87989
9        10       joel      76 river rd     des moines    ia   56433

In [5]:
df_data_puppies

,puppy_id,owner_id,puppy_name,age,gender,height_inches,color,favorite_food
0,1,1,wake,9.0,female,13.0,gray,dry food
1,2,1,yangoon,6.0,male,40.0,gray,dry food
2,3,2,keans,3.0,female,39.0,black,beef jerkey
3,4,2,reno,8.0,female,10.0,gray,chicken bites
4,5,3,oregon,0.0,female,13.0,brown,lamb treats
5,6,3,eugene,10.0,male,12.0,gray,lamb treats
6,7,4,nogales,12.0,female,18.0,gray,beef jerkey
7,8,4,wilkes,1.0,female,39.0,black,chicken bites
8,9,5,raleigh,7.0,female,12.0,golden,dry food
9,10,5,eagle,3.0,male,27.0,gray,beef jerkey
10,11,6,oakley,2.0,male,47.0,golden,lamb treats
11,12,6,nampa,7.0,female,45.0,beige,beef jerkey
12,13,7,young,5.0,male,32.0,white,lamb treats
13,14,7,kalamazoo,7.0,female,38.0,gray,chicken bites
14,15,8,edison,5.0,male,21.0,gray,lamb treats
15,16,8,wayne,11.0,female,17.0,golden,lamb treats
16,17,9,newton,11.0,male,36.0,beige,beef jerkey
17,18,9,yuma,1.0,male,43.0,beige,beef jerkey
18,19,10,orange,2.0,female,32.0,beige,dry food
19,20,10,reedley,6.0,female,30.0,beige,beef jerkey

In [6]:
df_data_owner['owner_name'] = df_data_owner['owner_name'].str.capitalize()
df_data_owner['address'] = df_data_owner['address'].str.title()
df_data_owner['city'] = df_data_owner['city'].str.title()
df_data_owner['state'] = df_data_owner['state'].str.upper()

In [7]:
df_data_owner

   owner_id owner_name          address           city state zipcode
0         1       Marc       120 Elm St          Miami    FL   30050
1         2      Frank  151 Johnson Ave         Austin    TX   77102
2         3      Maria   746 Clinton Ct   Philadelphia    PA   11203
3         4     Joanne    12003 Main St     Littletown    KS   20303
4         5      Miles    12034 Main Rd      Smalltown    MS   24455
5         6       Luke    74847 Left Ln        Seattle    WA   98748
6         7      Moses     836 Ocean Dr  San Francisco    CA   98288
7         8     Hannah     89 Pines Ave    Albuquerque    NM   11253
8         9      Sarah    345 Valley St        Phoenix    AZ   87989
9        10       Joel      76 River Rd     Des Moines    IA   56433

In [8]:
owner_count_rows = 'Number of records in \'owner\' table:  ' + str(len(df_data_owner))
owner_count_rows

"Number of records in 'owner' table:  10"

In [9]:
owner_count_columns = 'Number of columns in \'owner\' table:  ' + str(df_data_owner.count(axis = 1)[0])
owner_count_columns

"Number of columns in 'owner' table:  6"

In [10]:
owner_groupby_attribute = df_data_owner.groupby(['state']).size()
owner_groupby_attribute

state
AZ    1
CA    1
FL    1
IA    1
KS    1
MS    1
NM    1
PA    1
TX    1
WA    1
dtype: int64

In [11]:
df_data_puppies['puppy_name'] = df_data_puppies['puppy_name'].str.title()
df_data_puppies['age'] = df_data_puppies['age'].astype(int)
df_data_puppies['favorite_food'] = df_data_puppies['favorite_food'].str.title()

In [12]:
df_data_puppies

,puppy_id,owner_id,puppy_name,age,gender,height_inches,color,favorite_food
0,1,1,Wake,9,female,13.0,gray,Dry Food
1,2,1,Yangoon,6,male,40.0,gray,Dry Food
2,3,2,Keans,3,female,39.0,black,Beef Jerkey
3,4,2,Reno,8,female,10.0,gray,Chicken Bites
4,5,3,Oregon,0,female,13.0,brown,Lamb Treats
5,6,3,Eugene,10,male,12.0,gray,Lamb Treats
6,7,4,Nogales,12,female,18.0,gray,Beef Jerkey
7,8,4,Wilkes,1,female,39.0,black,Chicken Bites
8,9,5,Raleigh,7,female,12.0,golden,Dry Food
9,10,5,Eagle,3,male,27.0,gray,Beef Jerkey
10,11,6,Oakley,2,male,47.0,golden,Lamb Treats
11,12,6,Nampa,7,female,45.0,beige,Beef Jerkey
12,13,7,Young,5,male,32.0,white,Lamb Treats
13,14,7,Kalamazoo,7,female,38.0,gray,Chicken Bites
14,15,8,Edison,5,male,21.0,gray,Lamb Treats
15,16,8,Wayne,11,female,17.0,golden,Lamb Treats
16,17,9,Newton,11,male,36.0,beige,Beef Jerkey
17,18,9,Yuma,1,male,43.0,beige,Beef Jerkey
18,19,10,Orange,2,female,32.0,beige,Dry Food
19,20,10,Reedley,6,female,30.0,beige,Beef Jerkey

In [13]:
puppies_count_rows = 'Number of records in \'puppies\' table:  ' + str(len(df_data_puppies))
puppies_count_rows

"Number of records in 'puppies' table:  20"

In [14]:
puppies_count_columns = 'Number of columns in \'puppies\' table:  ' + str(df_data_puppies.count(axis = 1)[0])
puppies_count_columns

"Number of columns in 'puppies' table:  8"

In [15]:
df_data_puppies['age'] = df_data_puppies['age'].astype(int)
puppies_groupby_attribute = df_data_puppies.groupby(['color']).size()
puppies_groupby_attribute

color
beige     5
black     2
brown     1
golden    3
gray      8
white     1
dtype: int64